# Type Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BrowserOrganization..::..Type Property
BrowserOrganization Class See Also
---
Get BrowserOrganizationType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public BrowserOrganizationType Type { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Type As BrowserOrganizationType
	Get
```

Visual C++
---
```text
public:
property BrowserOrganizationType Type {
	BrowserOrganizationType get ();
}
```

# See Also
BrowserOrganization Class
Autodesk.Revit.DB Namespace